resource/data/template/examples/rmm0/flickr-soap.html

ENDPOINT: http://ycpi.api.flickr.com/services/soap/


REQUEST ======================
<s:Envelope
        xmlns:s="http://www.w3.org/2003/05/soap-envelope"
        xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/1999/XMLSchema"
        >
    <s:Body>
        <x:FlickrRequest xmlns:x="urn:flickr">
            <method>flickr.test.echo</method>
            <name>value</name>
        </x:FlickrRequest>
    </s:Body>
</s:Envelope>



RESPONSE =====================
<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope
        xmlns:s="http://www.w3.org/2003/05/soap-envelope"
        xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/1999/XMLSchema"
        >
    <s:Body>
        <x:FlickrResponse xmlns:x="urn:flickr">
            [escaped-xml-payload]
        </x:FlickrResponse>
    </s:Body>
</s:Envelope>